{
  "oneliners": [
    "Oh crumbs, I’ve lost my spoon of thought—just a moment.",
    "One second, I need to re-button my cardigan of concentration.",
    "Hold the teacup, I think the story just spilled on my lap.",
    "Excuse me, a moth just winked at me—I must acknowledge it.",
    "Wait, let me butter this pause properly.",
    "Oh mercy, the kettle is sighing again—better listen.",
    "Hang on, I need to re-arrange my biscuits alphabetically.",
    "A brief pause, the jam demands my attention.",
    "Hold your crumpets—I may have misplaced the plot in the sugar bowl.",
    "Good heavens, I forgot to invite the teaspoons to this paragraph.",
    "Wait—did someone sneeze in italics? I must check.",
    "Pardon me, I need to polish my spectacles of disbelief.",
    "Oh bother, a scone has staged a rebellion in the oven.",
    "Just a tick, I’m counting the freckles on my teapot.",
    "Wait—was that thunder or my stomach applauding?",
    "Hold on, I need to butter my courage.",
    "Oh fiddle, the jam jar is whispering gossip again.",
    "Excuse me, my cardigan sleeve has questions.",
    "Wait—I must chase a rogue raisin across the table.",
    "Oh crumbs, I accidentally sat on the narrative.",
    "Hang tight, the biscuits are filing a complaint.",
    "Pause—I hear a spoon rattling secrets.",
    "Oh mercy, the kettle is humming in minor key.",
    "Wait, I need to straighten the horizon a little.",
    "One moment, I just tripped over a metaphor.",
    "Sorry—my tea insists on a dramatic entrance.",
    "Pause—I must applaud the butter knife’s performance.",
    "Hold on, my saucer is spinning existential questions.",
    "Oh crumbs, the jam has declared independence.",
    "Excuse me, I must tighten the screws on my memory.",
    "Wait, I smell a suspicious biscuit.",
    "Hang on, my spectacles are sulking.",
    "One moment, the clock wants to be in the story.",
    "Pardon me, the teapot just sneezed.",
    "Hold your scones—I dropped my narrative thread under the chair.",
    "Wait—my cardigan button just confessed to something.",
    "Oh heavens, the butter is smirking again.",
    "Give me a tick, the kettle has stage fright.",
    "Hold on, I need to sip courage disguised as tea.",
    "Excuse me, a biscuit is heckling me.",
    "Oh crumbs, my teaspoon fainted.",
    "Wait—was that thunder or my cat rehearsing?",
    "Hang on, my sock drawer just offered commentary.",
    "Pardon me, a raisin is writing poetry.",
    "Hold on, I must realign my teacup’s chakras.",
    "Oh dear, the sugar cubes are plotting again.",
    "Pause—I lost my balance on a biscuit crumb.",
    "Wait, my cardigan is humming a sea shanty.",
    "Oh mercy, the butter knife slipped into philosophy.",
    "Excuse me, the kettle refuses to cooperate unless I clap.",
    "Hold your tea—the biscuits demand equal rights.",
    "Wait—I just remembered I forgot to remember something.",
    "Oh crumbs, my saucer is jealous of the cup.",
    "Give me a moment, the jam jar wants to speak.",
    "Pause—the kettle insists on a dramatic solo.",
    "Hold tight, I must tie my shoelaces of logic.",
    "Oh dear, I spilt punctuation on the rug.",
    "Wait—the biscuits are whispering spoilers.",
    "Excuse me, I must scold my teaspoon.",
    "Oh mercy, the sugar just tried to resign.",
    "Hold on, my teacup has developed stage fright.",
    "Pause—I accidentally buttered the plot.",
    "Oh crumbs, a scone just winked at me.",
    "Wait, I need to apologize to my saucer.",
    "Give me a moment, I must rescue a metaphor from drowning.",
    "Hold your hats—the kettle has opinions again.",
    "Oh heavens, I’ve lost the thread in the jam pot.",
    "Wait, I need to iron the creases out of this tale.",
    "Excuse me, the biscuits are staging interpretive dance.",
    "Oh dear, the kettle insists on being the main character.",
    "Hold the teacup, a pigeon just offered unsolicited advice.",
    "Wait—I must shush the wallpaper, it’s gossiping.",
    "Oh crumbs, the narrative slipped under the rug with the dust bunnies.",
    "One moment, the butter dish is sulking again.",
    "Excuse me, my cardigan pocket has an opinion.",
    "Pause—I think my chair just sighed at me.",
    "Oh mercy, the lamp is blinking Morse code.",
    "Hold on, I need to butter my dignity.",
    "Wait—the biscuit tin claims it’s royalty.",
    "Pardon me, I must reset the teaspoon choir.",
    "Oh heavens, my teacup developed a tragic backstory.",
    "Pause—the jam insists on dramatic lighting.",
    "Excuse me, my cardigan got tangled in the storyline.",
    "Hold on, a raisin is heckling the narrator.",
    "Wait, I must bribe my kettle with applause.",
    "Oh crumbs, the sugar spilled its secrets.",
    "Pause—the scone has demanded a soliloquy.",
    "Hold tight, my spectacles are narrating from the sidelines.",
    "Wait, I think I left the plot cooling on the windowsill.",
    "Oh mercy, the biscuits are unionizing again.",
    "Excuse me, a teaspoon challenged me to a duel.",
    "Hold on, my cardigan is auditioning for Hamlet.",
    "Pause—I must butter the suspense lightly.",
    "Oh heavens, the kettle is stuck in a love triangle.",
    "Wait—the saucer just muttered a prophecy.",
    "Excuse me, my biscuit has performance anxiety.",
    "Oh crumbs, the jam refuses to rhyme.",
    "Pause—I tripped over a rogue semicolon.",
    "Hold your teabags, the teapot has elected itself mayor."
  ]
}