{
  "id": "5feb5ac6-a138-40b1-8c3b-d274a67f4d21",
  "slug": "edna-snortwig",
  "name": "Edna Snortwig",
  "age": 62,
  "birthdate": "1963-07-15",
  "gender": "female",
  "occupation": "Museum of Accidental Communication",
  "workplace": {
    "name": "Museum of Accidental Communication",
    "slug": "unknown",
    "role": "Museum of Accidental Communication"
  },
  "address": {
    "street": "Unknown Street",
    "number": "1",
    "full": "Unknown Street, Pjuskeby"
  },
  "favorites": {
    "places": []
  },
  "traits": [
    "unintentional messaging",
    "pickle juggling"
  ],
  "bio_short": "**The Museum of Accidental Communication** Edna Snortwig didn't intend to become the curator of Pjuskeby's Museum of Accidental Communication; the role sort of hiccuped into her life. In her youth, she had aspirations of becoming a philosopher, but philosophy was a bit too preoccupied with existential murmurs for her taste. One day, while watching a squirrel attempt to converse with a wind-up toy, Edna realized that the most profound messages are those we stumble upon quite by accident. The Museum of Accidental Communication sits serenely at the end of Whispering Fjord Lane, housed in what used to be a hat...",
  "bio_full": "**The Museum of Accidental Communication**\n\nEdna Snortwig didn't intend to become the curator of Pjuskeby's Museum of Accidental Communication; the role sort of hiccuped into her life. In her youth, she had aspirations of becoming a philosopher, but philosophy was a bit too preoccupied with existential murmurs for her taste. One day, while watching a squirrel attempt to converse with a wind-up toy, Edna realized that the most profound messages are those we stumble upon quite by accident.\n\nThe Museum of Accidental Communication sits serenely at the end of Whispering Fjord Lane, housed in what used to be a hat shop for elves. Visitors are greeted by an ancient doorknob that only acknowledges hands that have encountered a lost thought. Inside, Edna has collected a multitude of artifacts that speak in ways their creators never intended. There's an umbrella that recites haikus when it rains, a pair of spectacles that only focus on life's ironies, and a collection of letters written in the language of sneezes. \n\nAmong the most prized pieces is Edna herself. Known to burp in Morse code, she occasionally releases a series of messages that are often mistaken for gastronomic expressions. One memorable incident involved her burping an entire poem, which was later decoded to reveal the tragic tale of a lovesick otter. The townsfolk long stopped questioning, accepting with a nod that Edna's communication talents were as uncharted as the fjords themselves.\n\n**Pickle Juggling and Related Pursuits**\n\nEdna's fascination with pickles began one crisp autumn evening when a jar of her grandmother's pickled herring accidentally rolled off the shelf and performed an elegant pirouette before landing upright, unharmed. Inspired by this unforeseen grace, Edna took up the pursuit of pickle juggling, a pastime that requires both finesse and a certain disregard for convention.\n\nEvery Wednesday at 4:17 PM, you’ll find Edna at Foggy Brine Park, coaxing cucumbers and gherkins into celestial dances. With the precision of a maestro, she juggles three, sometimes four, pickles at once—each one somersaulting through the air with uncanny rhythm. Onlookers often find themselves mesmerized by this display of controlled chaos, and it's not uncommon for spontaneous applause to break out, supplemented by the rhythmic clinking of jar lids.\n\nEdna prefers her pickles to be of the dill persuasion, claiming they hold the best air-time. She has an obscure theory that the tone of the pickle’s “pop” when it lands is directly correlated with the movement of the northern lights, an idea she has yet to prove but finds thrilling to ponder nonetheless.\n\n**The Morning Sonata**\n\nEvery morning, precisely at 5:42 AM, Edna performs what she has dubbed the Morning Sonata—a ritual as curious as it is consistent. It begins with her deep inhalation of the crisp morning air, followed by a hopscotch session using stones engraved with the Norwegian alphabet. Each hop corresponds to a letter, and by the time she's exhausted the vowels, she’s generally convinced the sun to rise at a slightly more agreeable angle.\n\nOnce inside, she brews a pot of lingonberry tea and partakes in a brief but spirited conversation with the teakettle, which she's named Sir Boil-a-lot. The kettle whistles in three distinct pitches, which Edna interprets as advising her on the day's most opportune sauntering paths.\n\nThe final act of her ritual involves waking her companionable cat, Captain Nudge. He has an impressive mustache and a penchant for philosophical debates, often pondering the existence of an eighth day of the week where all socks are perpetually paired.\n\n**What Edna Snortwig Loves**\n\nEdna loves the moments in between moments—the spaces where silence tiptoes and time decides to take a nap. She is fond of the smell of first snow, the sight of fog lifting like a veil from the hills, and the sound of sparrows gossiping in the eaves of her cottage. The untamed laughter of child-aged clouds above Pjuskeby fills her heart with an unfathomable warmth.\n\nBut perhaps more than anything, Edna cherishes the connections forged through miscommunication—the surprising clarity that emerges from unguarded blunders. Her favorite possession is a collection of accidental love notes penned by clumsy typists, each one an ode to the beauty of unintended affection.\n\n**What Edna Snortwig Hates**\n\nThough hate is a strong word, Edna has a mild aversion to perfectly planned events, as they leave no room for happenstance—a detail she finds profoundly stifling. Predictability, with its tedious predictableness, is a dear foe of hers. She also possesses a deep-seated mistrust of objects with too many buttons, believing they harbor ambitions of needless complexity.\n\nShe is wary of the autumn leaves' rustle, a sound that reminds her of secrets whispered too loudly. And while Edna nourishes a healthy relationship with most creatures, she harbors a particular distaste for seagulls that impersonate other birds for their own amusement.\n\n**The Legacy of Edna Snortwig**\n\nIn the quiet moments before sleep, Edna often dreams of a future where the Museum of Accidental Communication expands to include whispers carried by the wind and conversations between dancing shadows. She envisions a world more attuned to the language of the unexpected—a place where missed beats become musical interludes and lost thoughts find homes in hearts they were never meant for.\n\nAs for her personal legacy, Edna aspires to be remembered as the woman who saw wisdom in whimsy, who taught Pjuskeby the art of listening to silence, and who unraveled the hidden messages in a humble burp.\n\nEdna Snortwig's life is a tangle of serendipitous absurdities, woven into the rich tapestry of Pjuskeby folklore. Hers is a story still unfolding, narrated by the oddities and oddments she so dearly loves.",
  "personality": {
    "traits": [
      "unintentional messaging",
      "pickle juggling"
    ]
  }
}