{
  "id": "683ee918-bced-46dc-b7e4-0065b090de56",
  "slug": "franny-featherknees",
  "name": "Franny Featherknees",
  "age": 42,
  "birthdate": "1983-03-17",
  "occupation": "Sandwich Lullaby Specialist",
  "workplace": {
    "name": "Sleepytime Sandwich Co.",
    "slug": "sleepytime-sandwich-co",
    "role": "Chief Nocturnal Nutrition Officer"
  },
  "address": {
    "street": "Wobblekollen Lane",
    "number": "23A",
    "full": "23A Wobblekollen Lane, Pjuskeby"
  },
  "favorites": {
    "places": []
  },
  "traits": [
    "singing lullabies to soup",
    "competitive blinking",
    "chair conversations"
  ],
  "bio_short": "Franny Featherknees is Pjuskeby's most unusual sandwich maker, known for singing lullabies to her soup and conducting thorough negotiations with furniture before use. As Chief Nocturnal Nutrition Officer at Sleepytime Sandwich Co., she has revolutionized the concept of bedtime snacks through her unique approach to culinary somnambulism.",
  "bio_full": "**The Sleepytime Sandwich Philosophy**\n\nFranny Featherknees didn't choose the nocturnal nutrition business—it chose her, quite literally, in the form of a dream about sentient mayonnaise at 3:47 AM on a Tuesday in March 2019. She woke up with the unshakeable conviction that sandwiches were being made all wrong, that the bread was crying out for gentleness, that the lettuce needed emotional support, and most importantly, that soup required proper musical accompaniment.\n\nAt Sleepytime Sandwich Co., Franny has created what she calls \"drowsy dining\"—sandwiches specifically engineered to induce peaceful slumber. Her signature creation, the Whisper-Wheat Lullaby Special, contains seventeen ingredients that must be assembled in complete silence except for Franny's soft humming of Norwegian folk songs. She insists that the mayonnaise can hear the music and adjusts its molecular structure accordingly. Scientists from Pjuskeby University once tried to study this claim but fell asleep during the experiment.\n\nThe soup lullabies are Franny's most controversial practice. Every morning at 5 AM, she stands before enormous pots of tomato bisque, carrot ginger, and her experimental mushroom-dreams blend, singing them awake with custom compositions. She has written over three hundred soup-specific songs, each tailored to the temperament of the particular vegetable or legume. Her \"Ode to Confused Carrots\" won third place in Pjuskeby's Annual Absurdist Music Competition, though she insists it wasn't meant to be absurdist—the carrots really were confused that day.\n\n**The Chair Negotiation Protocol**\n\nFranny's habit of talking to chairs before sitting down began in childhood but evolved into a full philosophical system by her late twenties. She believes that furniture has memories embedded in its wood grain or cushion foam—echoes of every person who ever sat there, every conversation held, every nap taken. To sit without acknowledgment would be, in her words, \"profoundly disrespectful to the accumulated sitting experience.\"\n\nHer typical chair conversation goes like this: She approaches, makes eye contact with the chair (even if it has no eyes), introduces herself formally (\"Good morning, I'm Franny Featherknees, and I'm hoping we might sit together for a while\"), waits three seconds for what she calls \"the furniture's consent phase,\" then asks about the chair's day. Only after this protocol does she sit.\n\nColleagues at Sleepytime Sandwich Co. have grown accustomed to this. New employees are warned during orientation: \"If you hear Franny having a conversation in the break room, check if there's another person there before assuming she's on the phone.\" Most chairs in the building now have small name tags that Franny has assigned them—there's \"Gregory\" (the wobbly stool), \"Madame Spinster\" (the office chair that spins too freely), and \"The Council of Seven\" (the bench that seats seven people, which Franny insists contains seven distinct personalities).\n\n**Competitive Blinking Championship**\n\nFranny is Pjuskeby's reigning Competitive Blinking champion for three consecutive years, a title she defends with unexpected ferocity. Competitive Blinking, for the uninitiated, is not about blinking the most—it's about blinking with the most intentionality. Judges evaluate rhythm, eyelid coordination, emotional expression through blink timing, and what the rulebook mysteriously calls \"the space between blinks.\"\n\nFranny's signature technique is the \"Featherknees Flutter\"—a complex pattern of three quick blinks followed by a prolonged eye closure that somehow conveys both melancholy and hope. She practices in the mirror for forty-five minutes each morning, often while simultaneously humming lullabies to her breakfast toast. Her coach, an elderly woman named Petra who claims to have invented modern competitive blinking in 1987, says Franny has \"the most eloquent eyelids in Northern Europe.\"\n\nThe championships are held annually in Pjuskeby's town square, drawing crowds of hundreds who watch in near-silence as competitors blink at each other across a specially designed table. Franny's 2024 final match lasted six hours and forty-three minutes, ending only when her opponent, a visiting champion from Denmark, admitted he couldn't continue because he'd become \"emotionally overwhelmed by the beauty of her blinks.\"\n\n**What Franny Loves**\n\nFranny adores the moment right before dawn when Pjuskeby is still asleep and she's the only one awake in the bakery, singing to soup that's just beginning to simmer. She loves the sound of bread dough being kneaded—she calls it \"the heartbeat of patience.\" She's obsessed with finding the perfect pillow and currently owns thirty-seven different types, each named and assigned to specific moods or moon phases.\n\nShe collects recordings of people snoring, which she finds \"deeply honest and vulnerable,\" and has amassed a library of over two hundred hours of sleep sounds from Pjuskeby residents (all consensually recorded). She loves when chairs \"talk back\"—the creaks and groans she interprets as furniture conversation. She's passionate about cloud shapes that look like sandwich ingredients, and maintains a photo album of \"Clouds That Resemble Cheese.\"\n\n**What Franny Hates**\n\nFranny cannot stand people who rush their sandwiches—she once asked a customer to leave Sleepytime Sandwich Co. because he was \"eating with aggressive energy.\" She hates loud restaurants, fluorescent lighting, and anyone who claims soup is \"just soup\" without acknowledging its emotional complexity. She despises alarm clocks (\"violence against natural waking\") and has instead trained herself to wake up when the first bird sings, which means her sleep schedule changes with the seasons.\n\nShe's deeply troubled by chairs that are pushed in too aggressively after someone stands up—she calls it \"furniture abuse\"—and has been known to comfort chairs that have been \"slam-sat.\" She hates the concept of competitive eating contests, which she views as the opposite of everything she stands for. Most of all, she cannot tolerate people who blink carelessly, without thought or intention, treating their eyelids like \"mere biological windshield wipers.\"\n\n**The Future of Drowsy Dining**\n\nFranny dreams of opening a sleep-cafe where everything—from the ambient music to the chair ergonomics to the sandwich composition—is designed to induce the most peaceful rest possible. She envisions beds instead of tables, with sandwiches served on heated trays that gently vibrate at frequencies proven to encourage theta brainwaves. The soup lullabies would play on loop, chairs would introduce themselves via small speakers, and competitive blinking tournaments would be held monthly in a dedicated wing.\n\nUntil then, she continues her work at Sleepytime Sandwich Co., one lullaby at a time, one chair conversation at a time, one intentional blink at a time, making Pjuskeby just a little bit stranger, softer, and more deeply asleep.",
  "personality": {
    "traits": [
      "deeply earnest",
      "absurdly methodical",
      "gentle to a fault"
    ]
  }
}