{
  "id": "d1003e7f-cdc7-421d-9a72-25c4485e5a73",
  "slug": "franklin-gloop",
  "name": "Franklin Gloop",
  "age": 75,
  "birthdate": "1950-03-24",
  "gender": "male",
  "occupation": "Weatherproof Pudding Labs",
  "workplace": {
    "name": "Weatherproof Pudding Labs",
    "slug": "unknown",
    "role": "Weatherproof Pudding Labs"
  },
  "address": {
    "street": "Unknown Street",
    "number": "1",
    "full": "Unknown Street, Pjuskeby"
  },
  "favorites": {
    "places": []
  },
  "traits": [
    "boiling milk at moonrise",
    "puddle inspection"
  ],
  "bio_short": "**The Pudding Phenomenon** Franklin Gloop, aged 75, has carved a life as the esteemed lead culinary alchemist at Weatherproof Pudding Labs. Perched on the edge of Pjuskeby’s great fjord, the lab is known for its windowpanes that catch storms in teacups instead of rainwater. The lab was initially a misunderstanding—Franklin had intended to open a mere diner specializing in custard, yet a misplaced comma on his application turned it into a hub for experimental meteorological desserts. Since then, Franklin has devoted his days to studying the symbiotic relationship between atmospheric pressure and pudding elasticity. His colleagues often speculate that Franklin...",
  "bio_full": "**The Pudding Phenomenon**\n\nFranklin Gloop, aged 75, has carved a life as the esteemed lead culinary alchemist at Weatherproof Pudding Labs. Perched on the edge of Pjuskeby’s great fjord, the lab is known for its windowpanes that catch storms in teacups instead of rainwater. The lab was initially a misunderstanding—Franklin had intended to open a mere diner specializing in custard, yet a misplaced comma on his application turned it into a hub for experimental meteorological desserts.\n\nSince then, Franklin has devoted his days to studying the symbiotic relationship between atmospheric pressure and pudding elasticity. His colleagues often speculate that Franklin himself might be made of pudding, after the unfortunate incident in 1997 when he accidentally sat in a vat of butterscotch and emerged looking entirely unperturbed. His skin retained a certain sheen and jiggle ever since, leading to all sorts of rumors and whispers in the town’s coffee enclave, Varm Kanel.\n\nEvery Thursday at precisely 4:47 PM, Franklin releases a batch of cloudberry soufflé balloons into the sky to measure barometric expectations. His theory, now a cornerstone of Pjuskeby weather prediction, posits that a pudding’s wobble can forecast precipitation with a 92.3% accuracy rate. The Nobel Prize committee, while intrigued, is said to still be wrangling with whether to categorize his triumph in physics, gastronomy, or interpretative dance.\n\n**The Puddle Chronicles**\n\nIn the labyrinthine confines of Franklin’s garden, one finds not a collection of the usual hydrangeas or ash trees, but rather an assortment of meticulously curated puddles. Each is catalogued in his \"Soggy Tome,\" a waterlogged diary dating back to 1968 that Franklin insists upon reading aloud every second Sunday of the month, much to the delight of the frogs.\n\nAmong his favored specimens is a venerable puddle named Sir Dribbleton III, situated just beneath the arch of the Singing Lilac—and, if one listens closely, the lilac indeed hums a soft melody when the moon is high. Franklin believes puddles to be fleeting mirrors of the earth’s most intimate thoughts, and he has spent many an hour mid-puddle, clad in his waterproof tweed, nose just inches from the water’s surface, seeking glimpses of truth suspended in raindrop reflections.\n\nThe townsfolk often giggle about Franklin’s puddling obsession, but all humbly acknowledge the fortune he found beneath one of them: a perfectly preserved lichen-encrusted violin from the 14th century, which now sings in the hands of Pjuskeby’s Philharmonic maestro, Frida Glimst.\n\n**The Boiling Moonlight Ritual**\n\nFranklin’s nightly ritual is one of splendid peculiarity and routine precision. At precisely moonrise, whether it falls at 7:04 PM or 2:18 AM, Franklin boils precisely 2.33 liters of goat’s milk atop a stove fashioned from the repurposed hull of a Viking ship. The milk, he claims, must reach the precise temperature of 72.9 degrees Celsius at the moment the moon peaks over the horizon, or else the balance of fortune tilts unfavorably for all of Pjuskeby.\n\nAs the cauldron of creamy liquid bubbles at the cusp of nightfall, Franklin mumbles the Recipe of Dreams—a half-concocted chant that he swears he learned in a vision shared with a particularly wise lynx. Each verse is a homage to the celestial cooks who, according to Franklin, bake the moon anew every night. Once the milk has boiled, he pours it into an ancient pewter basin and sets it upon his stoop to cool. If visitors are lucky, they might catch him scrying the milk's skin, seeking wisdom in the rivulets and creases that appear as it sets.\n\n**What Franklin Loves**\n\nFranklin’s heart beats allegretto when he’s deep in conversation with the town’s dust-laden librarian, Sigrid Pages, about the merits of fermented literature—an art form only they seem to comprehend. He loves the way a fresh snowfall seems to erase time, leaving behind a world curtained in the gentle hush of possibility.\n\nCinnamon rolls that mimic the helixes of time, moss in the shape of question marks, and laughter of the dandelions are all pathways to Franklin's joy. He loves the notion that cats possess a second language spoken only when humans aren't watching, and he's determined to become fluent before his next birthday.\n\n**What Franklin Hates**\n\nWhile Franklin is generally of a benevolent disposition, he harbors a deep-seated dislike for the texture of socks that have traversed the wrong side of crispy. Socks, in his view, belong in the realm of the perpetually soft and pliable, much like his beloved puddings. The sound of a bicycle chain in distress, particularly one that’s lost its battle against the morning dew, evokes an inexplicable melancholy in him.\n\nHe shudders at the idea of unyielding truths and overcast mornings that refuse to yield puddles. Seagulls—whom Franklin is convinced are merely disgraced poets in feathery disguise—also earn his disdain when they steal his freshly baked \"Predictive Tarts,\" stuffed with clouds and anticipation.\n\n**The Legacy of Franklin Gloop**\n\nIn the quiet spaces of his day where the air smells of caramelized hopes, Franklin dreams of a future where Pjuskeby is known globally as the epicenter of culinary meteorology. He envisions a museum dedicated to atmospheric desserts that shifts shape and flavor with the seasons, much like his own creations.\n\nHis will decrees that upon his departure from the earthly coil, his remains be mixed with the foundational pudding of his lab, so his essence might forever assist in forecasting the rains. It is his hope that the children of Pjuskeby will continue to measure the winds by his recipes and dance with umbrellas in the moon's reflective glow, laughing at the sky in defiance of routine and rain.\n\nFor Franklin Gloop, the legacy is less about the ripples he leaves behind and more about the puddles, the milk, and the whimsy of moonlit dreams shared with a charmingly odd town by the fjord.",
  "personality": {
    "traits": [
      "boiling milk at moonrise",
      "puddle inspection"
    ]
  }
}