{
  "id": "existing-id",
  "slug": "milly-wiggleflap",
  "name": "Milly Wiggleflap",
  "age": 78,
  "birthdate": "1947-06-22",
  "occupation": "Chief Weather Whisperer & Pudding Prophet",
  "workplace": {
    "name": "The Pudding Forecast Centre",
    "slug": "the-pudding-forecast-centre",
    "role": "Director of Cloud Interpretation & Dessert Divination"
  },
  "address": {
    "street": "Picklewhiff Crescent",
    "number": "13",
    "full": "13 Picklewhiff Crescent, Pjuskeby"
  },
  "favorites": {
    "places": [
      {
        "name": "Chatter Valley",
        "slug": "chatter-valley",
        "reason": "Where she first heard clouds gossip about tomorrow's weather"
      },
      {
        "name": "Skitter Pebble Beach",
        "slug": "skitter-pebble-beach",
        "reason": "The pebbles tell her which puddings will set properly"
      },
      {
        "name": "The Sunny Shimmy Shore",
        "slug": "the-sunny-shimmy-shore",
        "reason": "Her left sock collection began here after a particularly enthusiastic shimmy"
      }
    ]
  },
  "traits": [
    "collecting left socks",
    "tickling dandelions",
    "cloud psychology",
    "pudding prophecy",
    "conversational sheep-spotting"
  ],
  "bio_short": "Believes clouds are just lazy sheep",
  "bio_full": "Milly Wiggleflap didn't choose meteorology—meteorology sneezed on her one windy Tuesday in 1973, and she's been predicting weather through pudding consistency ever since. She arrived in Pjuskeby at age 31, carrying nothing but a wooden spoon, seventeen left socks, and an unshakeable conviction that clouds were sheep who'd given up on gravity.\n\nShe was right, of course. But no one believed her until 1989, when a particularly argumentative cumulus admitted it during a town meeting.\n\nMilly lives at 13 Picklewhiff Crescent—a house that smells perpetually of custard and optimism. The number 13 doesn't bother her. She says it's just 12 with aspirations. Her front garden is full of dandelions she tickles every morning at 6:23 AM sharp. They giggle. She records their laughter. She's been doing this for forty-seven years and has published exactly zero academic papers about it, which she considers her greatest achievement.\n\n**The Pudding Forecast Centre**\n\nMilly founded The Pudding Forecast Centre in her kitchen in 1979 after realizing that the consistency of vanilla pudding directly correlated with atmospheric pressure, and chocolate pudding could predict emotional weather three days in advance. The Centre now occupies a small blue building on the corner of Picklewhiff Crescent and Waffleknob Way, though \"occupies\" is a strong word—mostly it just leans there, sighing occasionally.\n\nEvery morning, Milly prepares six different puddings, observes how they set, tastes them (professionally, she insists), and then announces the day's forecast by ringing a bell shaped like a sheep. Her predictions are 87% accurate, which is higher than the national weather service and far more delicious.\n\nShe doesn't predict rain or sunshine. She predicts things like:\n- \"Mild confusion with a chance of spontaneous poetry\"\n- \"Overcast thoughts, clear by teatime\"\n- \"High probability of finding lost things you weren't looking for\"\n- \"Gentle existential dread, fading into acceptance by noon\"\n\nPeople trust her forecasts more than their own feelings.\n\n**The Clouds Are Lazy Sheep Theory**\n\nMilly's most famous (and controversial) belief is that clouds are not water vapor at all—they're just sheep who got too tired to keep walking and decided to float instead. She has an entire filing cabinet of evidence, including:\n- Seventeen photographs of clouds that look exactly like sheep (\"Because they ARE sheep,\" she argues)\n- A recorded conversation with a cumulus named Gerald who admitted to being \"a bit of a floater\"\n- The fact that clouds move in flocks, just like sheep\n- Her own personal experience of once seeing a cloud baa (though she admits she may have been very tired)\n\nThe scientific community has, predictably, ignored her. The sheep community, however, sends her birthday cards.\n\n**The Left Sock Collection**\n\nMilly has been collecting left socks since 1975, when she noticed that only left socks ever go missing. Right socks, she insists, are \"far too sensible and lack imagination.\" Her collection now numbers 1,847 left socks, each carefully catalogued by color, pattern, and \"emotional texture.\"\n\nShe displays them in her living room on a series of clotheslines arranged like a gallery. Visitors are encouraged to browse. Some socks have names. One is called Trevor. Trevor is argyle and \"profoundly melancholic,\" according to Milly.\n\nShe believes the missing right socks have formed a society somewhere and are planning something. She's not sure what. But she's ready.\n\n**Tickling Dandelions**\n\nEvery morning, Milly tickles the dandelions in her garden. Not all of them—just the ones that look like they need it. She uses a single feather (from a duck named Barnaby who visits on Thursdays) and gently brushes each dandelion's stem while whispering compliments.\n\nThe dandelions respond. Sometimes with giggles. Sometimes with sighs. Once, a particularly dramatic dandelion fainted, and Milly had to revive it with a tiny glass of water and an apology.\n\nShe records their responses in a leather-bound journal titled *Conversations With Small Yellow Friends: A Longitudinal Study in Botanical Emotional Intelligence*. She has no plans to publish it. \"It's private,\" she says. \"Between me and the dandelions.\"\n\n**What Milly Loves:**\n\n- Clouds. All of them. Even the boring ones.\n- Pudding. Specifically, pudding with opinions.\n- Left socks. The more mismatched, the better.\n- Dandelions with a sense of humor.\n- Sheep, both grounded and airborne.\n- People who admit they don't know things.\n- Tuesdays. She finds them \"underrated and sincere.\"\n\n**What Milly Hates:**\n\n- People who say \"it's just weather.\" It's never *just* weather.\n- Right socks that act superior.\n- Meteorologists who use radar instead of pudding. \"Cowards,\" she mutters.\n- The phrase \"that's impossible.\" She's seen clouds baa.\n- Anyone who mows dandelions without asking permission first.\n- Cynicism. She believes it curdles pudding from a distance.\n\n**Relationships & Daily Life**\n\nMilly's best friend is a teapot named Doris who whistles in B-flat and offers surprisingly good advice during thunderstorms. Her second-best friend is the mailman, who once delivered a cloud (long story involving mistaken address and atmospheric confusion).\n\nShe's been proposed to twice—once by a sheep farmer who thought she understood livestock, and once by a cloud who turned out to be fog with commitment issues. She declined both, citing \"incompatible circadian rhythms\" and \"a general preference for pudding.\"\n\nEvery evening at 7 PM, Milly sits on her porch, watches the sky, and counts sheep. Sometimes they're real. Sometimes they're clouds. She doesn't mind either way. She rates them on a scale of \"woolly\" to \"magnificent,\" takes notes, and then goes inside to prepare tomorrow's pudding.\n\nIf you meet Milly, she'll offer you pudding, show you her sock collection, and ask if you've noticed the clouds looking particularly tired lately. She'll nod knowingly when you answer, whether you say yes or no.\n\nAnd if you're very lucky—if the dandelions are in a good mood and the pudding has set just right—she'll tell you what the weather will feel like tomorrow.\n\nShe's usually right.",
  "personality": {
    "traits": [
      "Gently eccentric",
      "Scientifically unorthodox",
      "Deeply observant",
      "Quietly confident",
      "Tenderly absurd"
    ],
    "quirks": [
      "Predicts weather through pudding",
      "Talks to clouds as if they're sheep",
      "Catalogs left socks by emotional texture",
      "Tickles dandelions with a duck feather",
      "Rates sheep on a woolly-to-magnificent scale"
    ]
  },
  "relationships": {
    "objects": [
      {
        "name": "Doris",
        "type": "Teapot",
        "status": "Best friend, whistles in B-flat"
      },
      {
        "name": "Trevor",
        "type": "Argyle sock",
        "status": "Profoundly melancholic, part of collection"
      }
    ],
    "animals": [
      {
        "name": "Barnaby",
        "type": "Duck",
        "status": "Visits Thursdays, provides tickling feather"
      },
      {
        "name": "Gerald",
        "type": "Cumulus cloud (former sheep)",
        "status": "Admitted to being 'a bit of a floater'"
      }
    ]
  },
  "created_at": "2025-10-16T12:57:41.849Z",
  "updated_at": "2025-10-17T13:55:00.000Z",
  "status": "active"
}
