{
  "id": "8d8df152-ea9f-4273-ac1d-64b2ed8cf77d",
  "slug": "nora-bumblebash",
  "name": "Nora Bumblebash",
  "age": 59,
  "birthdate": "1966-05-27",
  "gender": "female",
  "occupation": "The Aquarium of Forgotten Feelings",
  "workplace": {
    "name": "The Aquarium of Forgotten Feelings",
    "slug": "unknown",
    "role": "The Aquarium of Forgotten Feelings"
  },
  "address": {
    "street": "Unknown Street",
    "number": "1",
    "full": "Unknown Street, Pjuskeby"
  },
  "favorites": {
    "places": []
  },
  "traits": [
    "underwater poetry",
    "hosting silent tea parties"
  ],
  "bio_short": "**The Aquarium of Forgotten Feelings** Nora Bumblebash is the hallowed keeper and sole curator of Pjuskeby's most enigmatic establishment: The Aquarium of Forgotten Feelings. A sanctuary submerged beneath the town's library, the aquarium houses an uncanny collection of fish believed to embody emotions long misplaced by their human originators. Nora is particularly fond of the Shamed Salmon, a species she claims turns a surreptitious shade of pink whenever spotlighted by the curious gaze of a visitor. Convinced that fish are capable of experiencing and expressing the full spectrum of human sentiments, Nora conducts weekly empathy readings with the aquarium's more...",
  "bio_full": "**The Aquarium of Forgotten Feelings**\n\nNora Bumblebash is the hallowed keeper and sole curator of Pjuskeby's most enigmatic establishment: The Aquarium of Forgotten Feelings. A sanctuary submerged beneath the town's library, the aquarium houses an uncanny collection of fish believed to embody emotions long misplaced by their human originators. Nora is particularly fond of the Shamed Salmon, a species she claims turns a surreptitious shade of pink whenever spotlighted by the curious gaze of a visitor.\n\nConvinced that fish are capable of experiencing and expressing the full spectrum of human sentiments, Nora conducts weekly empathy readings with the aquarium's more reticent residents. Clad in a flowing gown of seaweed-hued silk and cradling a conch shell to amplify her whispers, she encourages each fish to embrace its feelings, however bashful they might be. The Splashing Solitude Sunday is an event famed for its muted rhapsodies, where Nora gently persuades the Awkward Angelfish to confront their social anxiety through synchronized swimming seminars.\n\nFish therapy sessions take place with the aid of bubbles blown from rainbow-colored straws, each one a buoyant vessel of encouragement. Her office is a tumult of tinkling aquatic symphonies and the gentle rustling of empathy scales—scripts she adheres to the tank walls, whispering encouragement to any piscine onlookers. After all, as Nora insists, even the most stoic cod might harbor a welter of emotions beneath its scaly façade.\n\n**The Book of Underwater Poetry**\n\nOutside her piscine pursuits, Nora finds solace in cultivating an anthology called The Book of Underwater Poetry. Bound in cowhide aged to perfection by the briny depths, it’s a collection of works composed entirely by whispering underwater to pages waterproofed by secret, ancient Nordic runes. Each evening, at precisely 7:42 PM, Nora dons her favorite pair of polka-dot rubber gloves and dips her quill (fashioned from the fin of a word-loving walleye) into octopus ink.\n\nA lover of literature’s gentle gurgle, Nora crafts odes to the mysteries of the sea—epics that explore the existential yearnings of the mollusk, or celebrate the wistful nature of a drifting jellyfish whose heart beats like a caged marimba. Her most controversial poem, The Lament of the Guilt-ridden Guppy, has been acclaimed by the Pjuskeby Poetry Council for its haunting portrayal of existential piscine ennui.\n\nThe pages, guarded zealously by a retired puffin named Professor Squelch, are never read aloud. Nora maintains that the ocean’s true beauty lies in its secrets, much like a pearl ensconced in its protective shell, waiting but never eager to emerge.\n\n**Silent Tea Parties**\n\nEvery morning, as dawn stretches her arms over the fjords, Nora engages in her daily ritual: a Silent Tea Party. Held precisely at 6:08 AM (a time chosen for its palindrome authenticity), she sets an ornate table of mismatched teacups and saucers in her garden, which unfurls atop an ancient mound known locally as Mumble Hill. Joined by her closest confidants—life-sized, expertly dressed mannequins she affectionately refers to as the Placid Patrons—Nora pours tea brewed from water lilies and the vaporous sighs of morning dew.\n\nHer favorite tea party guest, a nameless mannequin crowned with a particularly jaunty pirate hat, is always seated to her left. Nora believes it reflects the mannequin’s penchant for adventure and sea shanties—qualities she infers from the wistful tilt of its immobile head.\n\nSilence reigns supreme during these gatherings, the only exception being the occasional puff of steam from the enchanted kettle named Ethel, who was alleged to have once conversed with a mermaid. As the steam disperses, Nora contemplates the wordless exchanges that flicker like sun-dappled waves between herself and her taciturn guests, each moment distilled into serenity.\n\n**What Nora Loves**\n\nNora is deeply infatuated with the notion of hidden worlds. Whether beneath the rippling surface of a pond or behind the eyes of a mismatched sock, she finds beauty in the unseen. She adores the rare days when the horizon bleeds into a watercolor sky, and the fish dance a ballet of buoyant bliss, casting aside their shyness. Forever enamored with the moon’s reflection—the ocean’s quiet confessor—she’ll often take to gazing out her attic window with a moonbeam for company, sketching lunar landscapes on her bedroom ceiling with a flick of phosphorescent ink.\n\nSecretly, she delights in the idea of invisible friendships, and cherishes the letters-to-the-unwritten she crafts for the pen-pal she never had. These letters, scattered by the northern winds, become the whispers that guide wanderers home.\n\n**What Nora Hates**\n\nNora abhors clocks, which she claims are tyrants of time, dourly keeping its passage in chains of regimented ticks. She detests the mundane hum of predictability neatly tucked inside every minute and has declared that time should flow like a shoal adrift, free and unanchored. Furthermore, Nora holds a particular disdain for plastic plants, which she sees as impostors devoid of the vulnerability and quirks that make a life alive. \n\nAnything that attempts to stifle imagination—gray skies draped in monotony, mechanized voices that lack the lilt of laughter—earns her resolute reprimand. Her most fervent ire is reserved for canned songs, whose soulless notes do little more than remind one how music should, and could, make hearts pirouette with glee.\n\n**A Legacy of Aquatic Whispers**\n\nThough Nora Bumblebash has lived 59 glorious years within Pjuskeby’s bounds, her dreams ripple toward tomorrow. She envisions an underwater opera, a symphony of scales where fish transcend their embarrassment to serenade the universe. This magnum opus, she believes, will mark a moment when human and piscine hearts beat as one.\n\nHer deepest aspiration is to weave an iridescent tapestry of her life’s work—a legacy enshrined in stories told by ocean breezes. Someday, she dreams her underwater poems will serve as lullabies for future wanderers, guiding them gently toward the edges of enchantment. And perhaps, amongst them, a young soul will pause to listen, and hear in the silence, the echo of a fish’s blush.",
  "personality": {
    "traits": [
      "underwater poetry",
      "hosting silent tea parties"
    ]
  }
}