{
  "id": "b448a69e-b04e-465f-aae9-31f3f010012b",
  "slug": "percy-snootwhistle",
  "name": "Percy Snootwhistle",
  "age": 66,
  "birthdate": "1959-03-22",
  "gender": "female",
  "occupation": "The Slightly Odd Bank",
  "workplace": {
    "name": "The Slightly Odd Bank",
    "slug": "unknown",
    "role": "The Slightly Odd Bank"
  },
  "address": {
    "street": "Unknown Street",
    "number": "1",
    "full": "Unknown Street, Pjuskeby"
  },
  "favorites": {
    "places": []
  },
  "traits": [
    "invisible flute concerts",
    "butterfly tax consulting"
  ],
  "bio_short": "**The Slightly Odd Bank** No one quite remembers how Percy Snootwhistle became the heart and fluctuating soul of The Slightly Odd Bank, the only financial institution in Pjuskeby where interest rates dance the waltz and the vault sings lullabies at twilight. Percy arrived as if conjured by a particularly energetic fjord mist, bringing with her a notebook of indeterminate color and an air of gentle, yet decisive eccentricity. She assumed her position at The Slightly Odd Bank at the whimsical age of 53, which is notably prime in the arithmetic of serendipity. Percy, much like the institution she steers, navigates...",
  "bio_full": "**The Slightly Odd Bank**\n\nNo one quite remembers how Percy Snootwhistle became the heart and fluctuating soul of The Slightly Odd Bank, the only financial institution in Pjuskeby where interest rates dance the waltz and the vault sings lullabies at twilight. Percy arrived as if conjured by a particularly energetic fjord mist, bringing with her a notebook of indeterminate color and an air of gentle, yet decisive eccentricity. She assumed her position at The Slightly Odd Bank at the whimsical age of 53, which is notably prime in the arithmetic of serendipity.\n\nPercy, much like the institution she steers, navigates the world with a peculiar yet steadfast logic. She devised the theory of Quantum Accounts, which posits that all savings exist simultaneously in a state of abundance and scarcity until observed by a curious raccoon. The bank's vault is operated by a series of melancholic sighs, which Percy assures everyone was a design choice, not a glitch. Her desk, perpetually cluttered with quills made from leftover Sunday pastries and ink distilled from moonlight, is where she crafts accounts that are as much poetry as they are mathematics.\n\nEvery Thursday, Percy conducts the Surplus Symphony, a ritual where bank clerk ledgers morph into sheet music under her orchestration. Clients often visit solely for the serenades, content just to hear their life savings hummed in D minor. And somehow, amidst this rhythmic chaos, Percy finds a way to ensure every account balances with the precision of a snowflake's descent.\n\n**Invisible Flute Concerts**\n\nOn evenings when the Northern Lights twirl their celestial ribbons above Pjuskeby, Percy retreats to her cozy nook under the eaves of her blue-tinged house, Holmenkollen Puffs. It's at these times she indulges in her favorite pastime—conducting Invisible Flute Concerts. To the casual observer, Percy appears to be waving her arms soundlessly at an unassuming patch of air, her eyes closed in concentration. However, the concertos she orchestrates are anything but silent to those attuned to the quiet frequencies of whimsy.\n\nHer imaginary flute, named Symphony Glimmerbliss, is said to have been crafted from the whispers of ancient birch trees and the giggles of the town's elusive snow sprites. Each concert features an audience of figurative butterflies—figment creatures of Percy's extensive consultancy—that flutter appreciatively in synchronized, non-existent applause. The repertoire spans from \"The Sonata of Soliloquy\" to \"The Nocturne of Nonsensical Nostalgia\", evoking a realm where sound and silence pirouette in harmonious absurdity.\n\n**Apologies to Bananas**\n\nPercy's mornings begin with an unusual ritual that has endeared her to Pjuskeby’s grocery store patrons, baffling tourists and endearing her to the townsfolk who nod knowingly. In her breakfast routine, she delicately picks up a banana, cradles it gently as if it were made of spun sugar, and whispers a courteous 'sorry' before peeling it. To Percy, this act is a necessary expression of empathy toward fruit, acknowledging the banana's noble sacrifice for the greater cause of nutrition.\n\nHer reasoning, though delivered with an earnest twinkle in her eye, stems from a belief in the interconnectedness of all produce. Each banana, she asserts, possesses the spirit of a retired juggler from Bergen, deserving of a dignified farewell. Her apologies are tender serenades of gratitude, conducted in the gentle, melodious hush of a storyteller paying homage to ephemeral heroes. Percy firmly believes that acknowledging the banana's graceful acceptance of its fate ensures a sweeter, more fulfilling taste.\n\n**What Percy Loves**\n\nPercy holds a deep, encompassing affection for the chirping echoes of silent laughter that reverberate through her life’s symphony. Her heart thrills at the sight of the first snowflake of winter, which she swears is always shaped like a comma, a harbinger of continued stories. She loves Wednesdays, which she describes as the week's gentle sigh, full of potential and untraveled paths. Her favorite color is \"the whisper of a dusk-lit fjord,\" a hue she insists is visible only to those with their eyes closed and their dreams open.\n\nPercy reveres every misshapen coin that finds its way onto her desk, considering each a talisman of slightly skewed fortune. The scent of pine needles resting on morning dew never fails to draw a smile from her, nor the sight of her cat, Rumbletoes, who possesses the remarkable ability to purr in iambic pentameter.\n\n**What Percy Hates**\n\nThere is little that irks Percy, save perhaps for the phenomenon of un-spun yarn—a chaos she deems as tragic as a joke without a punchline. She harbors a mild disdain for clocks that tick too loudly, asserting they disrupt the gentle passage of time with their incessant and unnecessary reminders that moments are fleeting. Percy cannot abide a book with dog-eared pages, viewing them as wounds that mar stories meant to remain uncreased and infinite.\n\nShe is also notably averse to the sound of dissonant whistles. The discordant notes disrupt her otherwise melodious internal musings, and she finds them to be the auditory equivalent of a mismatched sock—an offense against harmonious pairing.\n\n**The Symphony Yet to Be Played**\n\nAs the years weave into a tapestry of memories, Percy's future dreams remain vivid and fluttering like the lightest of snowdrift promises. She aspires to one day conduct a grand concerto for the fjords, where the resonance of her invisible flute will intertwine with the echoes of the mountains, and the entire town of Pjuskeby will be an audience in awe.\n\nPercy envisions a future where The Slightly Odd Bank becomes the first establishment to offer Butterfly Tax Consulting worldwide, capitalizing on her unique expertise. She hopes that when she eventually steps into the realm beyond the tangible, her legacy will be a bank where music and mathematics continue to intertwine, and every customer leaves with a heart as full as their account.\n\nAnd so, Percy Snootwhistle lives on, an architect of imbalance and harmony, a guardian of the unspoken and the unseen, conducting life as an endless overture to the remarkable.",
  "personality": {
    "traits": [
      "invisible flute concerts",
      "butterfly tax consulting"
    ]
  }
}