[
  {
    "name": "Makeout Mountain",
    "description": "Couples climb it to smooch against the cliff face and forget what embarrassment is."
  },
  {
    "name": "Sardine Pier",
    "description": "Where the sea splashes, the fish slap, and arguments over ‘who caught what’ echo forever."
  },
  {
    "name": "Thinky Bay",
    "description": "Ideal for deep thoughts like ‘Do marshmallows dream?’ while gulls offer unsolicited opinions."
  },
  {
    "name": "The Sunny Shimmy Shore",
    "description": "Locals sunbathe until their eyebrows melt and break into spontaneous sand dancing."
  },
  {
    "name": "Skitter Pebble Beach",
    "description": "A chaotic splash zone where skipping stones leads to personal growth and wet socks."
  },
  {
    "name": "Chatter Valley",
    "description": "Non-stop conversation since 1832. No one remembers the first sentence—or the last."
  },
  {
    "name": "Rattle Hill",
    "description": "Steep slope used for sledding and scream therapy. Helmets optional. Regrets guaranteed."
  },
  {
    "name": "Splashypaint Falls",
    "description": "Tiny waterfall, big splash fights. Most visitors leave wetter than intended—and slightly tie-dyed."
  },
  {
    "name": "Confuzzle Crossroads",
    "description": "No one goes the right way. Not even the signs. Excellent for unplanned adventures."
  },
  {
    "name": "Ruckus Ridge",
    "description": "Perfect hilltop for chaotic picnics, ice cream rocket launches, and interpretive yelling."
  },
  {
    "name": "Giggle Hillock",
    "description": "Come for the view, stay for the mysterious giggling moss. And the tingly ankles."
  },
  {
    "name": "Tumble Bluff",
    "description": "A scenic cliff ideal for mattress parachuting and questionable decisions. Bring snacks."
  },
  {
    "name": "Boingy Beach",
    "description": "Surf’s never up, but inflatable boat ballet is always in session."
  },
  {
    "name": "Creaky Corner",
    "description": "The oldest gate in town, creaks so much it counts as a horror podcast."
  },
  {
    "name": "Snickerwood",
    "description": "A tiny forest filled with laughter pollen and absurdly unhelpful owls."
  },
  {
    "name": "Paddle Lagoon",
    "description": "Rent a pedal boat and chat your way in a lazy circle. Purpose discouraged."
  },
  {
    "name": "Debate Dunes",
    "description": "The eternal question: Does pizza need sausage? The shouting never ends."
  },
  {
    "name": "Tanglebrush Shortcut",
    "description": "Spoiler: it’s never actually a shortcut. But you might find someone’s lost uncle."
  },
  {
    "name": "Jiggle Dock",
    "description": "Wooden pier for synchronized bellyflops and dramatic splash-offs."
  },
  {
    "name": "Whisper Swamp",
    "description": "Where ants ignore you but whisper rumors to your shoes. No one knows why."
  },
  {
    "name": "Bumpity Pass",
    "description": "Narrow path where everyone’s legally required to nudge each other gently."
  },
  {
    "name": "Spinnyfield",
    "description": "Open meadow for free-range dancing and standing on one leg until accepted."
  },
  {
    "name": "Babblespray Falls",
    "description": "A waterfall that sounds like it's trying to tell you something. Possibly gossip."
  },
  {
    "name": "Sparkle Knoll",
    "description": "Best sunset point in town. Also prime location for dramatic monologues and nose whistles."
  },
  {
    "name": "Sillyman’s Corner",
    "description": "Legend says the best lie wins a cake. No one’s ever seen the cake."
  }
]
