{
  "id": "40c3ef56-e681-4c1d-a4f9-ab96b68b8954",
  "slug": "trixie-wobblethorpe",
  "name": "Trixie Wobblethorpe",
  "age": 46,
  "birthdate": "1979-04-24",
  "gender": "female",
  "occupation": "Invisible Utensils Ltd.",
  "workplace": {
    "name": "Invisible Utensils Ltd.",
    "slug": "unknown",
    "role": "Invisible Utensils Ltd."
  },
  "address": {
    "street": "Unknown Street",
    "number": "1",
    "full": "Unknown Street, Pjuskeby"
  },
  "favorites": {
    "places": []
  },
  "traits": [
    "guessing the time incorrectly",
    "left-handed shadow puppets"
  ],
  "bio_short": "**Invisible Utensils Ltd.: The Art of Vanishing Spoons** In a town where the sounds of fjord breezes mingle with the scent of elderflower, there is a whisper of a place called Invisible Utensils Ltd.—an establishment one might miss, for it is hidden in plain sight, much like its most famous creation: the invisible soup spoon. Trixie Wobblethorpe is the mind behind this enterprise, a forty-six-year-old with a penchant for making the unseeable exquisitely real. Her invention, launched on a drizzly Thursday that refused to end, was birthed from the simple notion that soup tastes better when held by nothing at...",
  "bio_full": "**Invisible Utensils Ltd.: The Art of Vanishing Spoons**\n\nIn a town where the sounds of fjord breezes mingle with the scent of elderflower, there is a whisper of a place called Invisible Utensils Ltd.—an establishment one might miss, for it is hidden in plain sight, much like its most famous creation: the invisible soup spoon. Trixie Wobblethorpe is the mind behind this enterprise, a forty-six-year-old with a penchant for making the unseeable exquisitely real. Her invention, launched on a drizzly Thursday that refused to end, was birthed from the simple notion that soup tastes better when held by nothing at all.\n\nTrixie, though, is not concerned with the culinary experience; her interest lies in the art of paradox. She believes utensils should be felt, not seen—a statement she delivered to the dubious crowd at the Annual Pjuskeby Food and Oddities Fair. The invisible soup spoon, she explains, aligns with the philosophy of \"gustatory zen,\" a term she coined over a cup of beetroot tea. Her office at Invisible Utensils is a tapestry of sketches, floating in air, tethered by imagination. They say if you squint just right, you'll see her ideas dance like the northern lights on a cloudless night.\n\n**The Left-Handed Menagerie of Shadows**\n\nTrixie's shadow puppetry is renowned across Pjuskeby, where the labyrinthine lanes occasionally echo with laughter manifesting from shadow animals gamboling at her fingertips. The peculiarity, however, lies in her left-handed technique—a skill developed after a particularly insightful dream about a left-footed rabbit who could hop to the moon and back.\n\nHer favorite puppet is Leopold, a shadowy squirrel with a penchant for mischief and moonlight acrobatics. Each performance, Trixie insists, should be conducted precisely at 3:14 PM, a time she affectionately refers to as the \"Pi Hour.\" It is said that the shadows she crafts have personalities of their own, often engaging in silent yet expressive debates about the existential value of breakfast muffins versus pastries. \n\n**Clockwork in Chaos: Trixie's Daily Ritual**\n\nEvery day begins with Trixie attempting to guess the time—a ritual she has never quite mastered and perhaps never intends to. At precisely 8:03 AM, she announces what she believes to be the current hour. Invariably incorrect, this guess sets the tone for her day, a tradition she claims to have inherited from a great-grand-aunt who once owned a sentient grandfather clock with a penchant for pranks.\n\nFollowing this, she embarks on a stroll through the town square, clad in a cape of woven invisible thread (a failed experiment from the early days of Invisible Utensils). Her path is punctuated by pauses at each of the town's twelve clocks, where she bids them all good morning while adjusting their hands to reflect the time she guessed earlier—her polite way of bending reality to meet her expectations. \n\n**What Trixie Loves**\n\nTrixie’s heart beats in tune with the quiet absurdities of life. She loves the hiss of snow touching ground, a sound too soft for most but as vivid to her as a morning choir. She adores the secret society of mismatched socks—ones that have lost their partners over time and now form a club of eccentric loners. Her evenings are spent reading stories to these socks, each one with a tale of their own, narrated in a voice that dances like fire on a winter's hearth.\n\nHer affection also extends to porridge, especially when it's not porridge at all but an imagined meal of marshmallow clouds and cinnamon whispers—a creation served best in an invisible bowl, with, naturally, an invisible spoon.\n\n**What Trixie Hates**\n\nDespite her whimsicality, Trixie harbors an intense dislike for predictability and symmetry, both of which she fights with the zeal of someone avenging a fallen soufflé. Even numbers, with their desire for balance, bring a frown to her otherwise sunlit face. \n\nShe resents the existence of straight lines, believing they mock the beautiful chaos of the world’s natural curves. Staircases that don't creak irritate her sensibilities, as she finds solace in the music of imperfection. Trixie is also wary of umbrellas, which she considers overly ambitious—always trying to hold the sky at bay.\n\n**Trixie's Dream of Latent Legacies**\n\nAs Trixie ponders her legacy, she envisions a world where invisible utensils foster conversations between people and their meals. Her goal is to open a museum dedicated to invisibility, an experience relying not on sight but on the senses of touch, sound, and whimsy. Visitors would leave, not with invisible souvenirs, but with memories as tangible as moonlight reflected on the fjords.\n\nShe dreams of a time when clocks agree with her guesses, when each spoon, unseen yet undeniably present, becomes a reminder that life’s essence often lies in the spaces between. Perhaps, when she eventually hangs up her invisible spoon, Trixie will find her place among the clouds—a cloud of her own, inspiring others to embrace the beauty of the imperceptible.\n\nIn Pjuskeby, Trixie Wobblethorpe remains a figure of gentle rebellion and relentless imagination, a woman who found her calling in the spaces left unfilled by certainty, a connoisseur of the unseen, and a weaver of dreams spun from the fabric of the unremarkable.",
  "personality": {
    "traits": [
      "guessing the time incorrectly",
      "left-handed shadow puppets"
    ]
  }
}